app/views/comments/_comment.html.erb

            <% end %></small>
    <small data-toggle="tooltip" data-placement="top" title="(<%=comment.updated_at  %>)"><time><%= time_ago_in_words(comment.created_at) %> ago</time ></small>
---
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "author_id", "ancestry") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "privet"], ["post_id", 42], ["created_at", "2019-12-10 20:01:02.013513"], ["updated_at", "2019-12-10 20:01:02.013513"], ["author_id", 24], ["ancestry", "373"]]

      <%= link_to "Reply", new_post_comment_path(comment.post, :parent_id => comment.id), class:'btn btn-outline-primary' %>
      <% pre_vote = comment.votes.find { |vote| vote.author_id == current_author.id} %>
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."comment_id" = $1  [["comment_id", 373]]

        <% end %>
      <i><%= comment.votes.count %> <%= (comment.votes.count) == 1 ? 'Like' : 'Likes'%></i>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."comment_id" = $1 AND "votes"."count" = $2  [["comment_id", 373], ["count", 1]]