app/views/posts/_post.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 42]]
---
    <p><%= post.author.login %></p>
    <p data-toggle="tooltip" data-placement="top" title="Uniq views(<%= post.impressionist_count(:filter=>:ip_address) %>)"> <%= fa_icon "eye" %> Views: <%= post.impressions_count %> <%= fa_icon "comments" %> <%= post.comments.count %><small></p>