app/views/posts/_post.html.erb

    <h2><%= link_to post.title, post_path(post) %></h2>
    <p><%= post.author.first_name %></p>
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]