app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" ASC  [["post_id", 42]]
---
<h2>Comments</h2>
<% @post.comments.each do  |comment| %>