app/controllers/application_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_author
    if session[:author_id]
      @current_author ||= Author.find(session[:author_id])