app/controllers/authors_controller.rb

  def correct_author
    @authors = Author.find_by(id: params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("created_at", "updated_at", "login", "email", "password_digest", "confirm_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def confirm_email
    author = Author.find_by_confirm_token(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."confirm_token" = $1 LIMIT $2  [["confirm_token", "p-d64LrYr2KzSwCwHWtKeA"], ["LIMIT", 1]]