app/controllers/comments_controller.rb

    def correct_author
        @comment = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]

    def edit
      @post = Post.find(params[:post_id])
      @comment = @post.author.comments.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["author_id", 31], ["id", 385], ["LIMIT", 1]]

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
    @comment.author_id = current_author.id
    if @comment.ancestors.count <= 4
          respond_to do |format|
            if @comment.save
              format.js {render 'create', status: :created, location: @post}
              format.html { redirect_to @post, notice: 'Comment was successfully created.' }
            else
              format.html { redirect_to @post, alert: @comment.errors.full_messages.first }
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "author_id", "ancestry") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "privet"], ["post_id", 42], ["created_at", "2019-12-10 20:01:02.013513"], ["updated_at", "2019-12-10 20:01:02.013513"], ["author_id", 24], ["ancestry", "373"]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 373], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

  def update
    @comment = Comment.find(params[:id])
    @post = Post.find(params[:post_id])
    respond_to do |format|
      if @comment.update(comment_params)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 385], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
UPDATE "comments" SET "ancestry" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["ancestry", nil], ["updated_at", "2019-12-10 23:15:12.800024"], ["id", 379]]

  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    if (current_author.id == @comment.author_id)
    @comment.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 45], ["id", 378], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 378]]