app/controllers/password_resets_controller.rb

def create
  author = Author.find_by_email(params[:email])
---
SELECT "authors".* FROM "authors" WHERE "authors"."email" = $1 LIMIT $2  [["email", "truesspay@gmail.com"], ["LIMIT", 1]]

def update
  if @author.password_reset_sent_at < 1.hour.ago
    redirect_to new_password_reset_path, alert: "Password reset has expired."
  elsif @author.update_attributes(params.require(:author).permit(:password, :password_confirmation))
---
UPDATE "authors" SET "password_digest" = $1, "updated_at" = $2 WHERE "authors"."id" = $3  [["password_digest", "$2a$12$u.ZsIpG1yHTRJ1kgiQOL.OoYVExEY5LV51sWv5Y9S6nm7hDePjIWu"], ["updated_at", "2019-12-12 18:54:03.332058"], ["id", 47]]

def find_author
  @author = Author.find_by_confirm_token!(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."confirm_token" = $1 LIMIT $2  [["confirm_token", "ltEP_jqX9mM59a40zommWg"], ["LIMIT", 1]]