app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
---
  def correct_author
    @post = Post.find_by(id: params[:id])

SELECT "posts".* FROM "posts" WHERE (title LIKE '%privet%' OR content.to_s LIKE '%privet%') ORDER BY created_at DESC
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "gfdgdf"], ["created_at", "2019-12-10 20:02:00.690420"], ["updated_at", "2019-12-10 20:02:00.690420"], ["author_id", 24]]
---
  def create
    @post = Post.new(post_params)
    @post.author = current_author
    respond_to do |format|
      if @post.save