app/controllers/sessions_controller.rb

  def create
    author = Author.find_by_email(params[:email])
---
SELECT "authors".* FROM "authors" WHERE "authors"."email" = $1 LIMIT $2  [["email", "sapsay.99@mail.com"], ["LIMIT", 1]]