app/controllers/votes_controller.rb

INSERT INTO "votes" ("comment_id", "author_id", "created_at", "updated_at", "count") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment_id", 373], ["author_id", 24], ["created_at", "2019-12-10 20:00:51.509556"], ["updated_at", "2019-12-10 20:00:51.509556"], ["count", 1]]
---
  def create
    if already_voted?
      flash[:alert] = 'You have already voted'
    else
      respond_to do |format|
        if @comment.votes.create!(author: current_author, count: 1)

INSERT INTO "votes" ("comment_id", "author_id", "created_at", "updated_at", "count") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment_id", 374], ["author_id", 24], ["created_at", "2019-12-10 20:00:53.473025"], ["updated_at", "2019-12-10 20:00:53.473025"], ["count", -1]]
---
  def dislike
    if already_voted?
      flash[:alert] = 'You already voted'
    else
      respond_to do |format|
        if @comment.votes.create!(author: current_author, count: -1)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 373], ["LIMIT", 1]]
---
  def find_comment
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:comment_id])

SELECT 1 AS one FROM "votes" WHERE "votes"."author_id" = $1 AND "votes"."comment_id" = $2 LIMIT $3  [["author_id", 24], ["comment_id", 373], ["LIMIT", 1]]
---
  def already_voted?
    Vote.where(author_id: current_author.id, comment_id:
    params[:comment_id]).exists?

SELECT "votes".* FROM "votes" WHERE "votes"."comment_id" = $1  [["comment_id", 373]]
---
  def find_vote
    @vote = @comment.votes.find(params[:id])