app/models/author.rb

SELECT 1 AS one FROM "authors" WHERE "authors"."email" = $1 AND "authors"."id" != $2 LIMIT $3  [["email", "testtest@test"], ["id", 34], ["LIMIT", 1]]
---
  def email_val
    unless email.include?('@')